{
  "_id": "69184d3a456039b282c32435",
  "dedupeKey": "vice president, software engineering|vice president, software engineering||linkedin",
  "Company Name": null,
  "company": "Vice President, Software Engineering",
  "createdAt": "2025-11-15T10:09:38.141Z",
  "embeddings_large": [],
  "embeddings_small": [],
  "jobId": "4334580868",
  "jobScrapingUrl": "https://www.linkedin.com/jobs-guest/jobs/api/jobPosting/4334580868",
  "jobURL": "https://www.linkedin.com/jobs/view/vice-president-software-engineering-at-oasis-health-partners%C2%AE-4334580868?trk=public_jobs_topcard-title",
  "job_criteria": "SENIORITY LEVELExecutiveEMPLOYMENT TYPEFull-timeJOB FUNCTIONEngineeringINDUSTRIESConstruction, Software Development, and IT Services and IT Consulting",
  "job_description": "About YouYou are passionate about leveraging software to improve healthcare, with a deepcommitment to advancing value-based care models that drive better outcomes forpatients and providers. You are a servant leader with empathy and integrity,creating an environment where team members feel supported, empowered, and heard.You know high-performing teams are built on trust, collaboration and continuousgrowth, and are dedicated to fostering a culture where innovation,accountability and shared purpose thrive.Who We AreOasis Health Partners (Oasis) is building healthier communities by advancingprimary care. We partner with patients, providers and plans to providepersonalized, local care for seniors in towns across America. We believe thatpatient needs come first, and that primary care is the foundation ofpatient-centric healthcare. With Oasis, patients receive better access andcare. Providers receive the data, resources and expertise to be successful invalue-based care arrangements. Payors get the benefit of a solution thatimproves performance, drives growth and reduces the total cost of care inhard-to-engage markets. Together, we will boldly advance primary care for those that need it most. Weare excited for you to join us on this journey. We invite you to be a part ofOasis, where you'll discover we do the right thing, build things together and goall in --- all while having fun! Your Role The Vice President of Software Engineering will report to the Chief Data andAnalytics Officer (CDAO) and serve as both a strategic leader and a hands-ontechnical expert. You will help lead and build our small but high-impactSoftware Engineering team. You will be tasked with building a scalable moderntech stack. You will build reliable applications and products for internalstakeholders and external partners. This role is ideal for someone who enjoyscoding, mentoring and setting technical direction.Additional Responsibilities Include * Providing architectural guidance and hands-on technical leadership * Fostering a culture of collaboration, accountability and continuous improvement * Designing, building and maintaining scalable applications * Building and integrating APIs to pull and update data * Collaborating with the Product Owner and Payor Data SME to prioritize and deliver roadmap initiatives * Partnering cross-functionally to understand data needs and define scalable solutions * Managing project timelines, resourcing and delivery milestones * Overseeing data security best practices, including HIPAA-compliant architecture * Ensuring data access governance, monitoring, and secure operations in AWS and Snowflake In the first 12 months you can expect to: * Design and execute plan to build direct data integrations with multiple EMRs * Ensure the successful implementation of all new data feeds * Manage multiple concurrent priorities * Collaborate with the Product Owner and CDAO to align Software Engineering priorities with business objectives * Translate roadmap initiatives into technical deliverables with clear milestones and capacity planning * Partner with stakeholders to identify new data products or features that support value-based care initiatives * Drive initiatives that position the data platform to scale with company growth * Help build Oasis ML/AI architecture and predictive models Investment In Our Team We invest in the personal and professional success of our team. We take care ofour people and offer robust benefits including medical, dental, vision, 401k andgenerous time off plans. We are committed to supporting your growth with adevelopment program that starts with onboarding and continues throughout yourcareer. As an inclusive, passionate, and diverse team, you will partner withprofessionals who understand the importance of high-value, high-impact patientcare. We invite you to be a part of Oasis Health, where you'll discover we listenfirst, build things together, always do the right thing, have fun and mostimportantly, are all in! About You * 15+ years of experience in Software Engineering * 7+ years leading Software Engineering teams * Deep expertise with AWS services * Full stack technical experience including cloud infrastructure (AWS), web client frameworks (e.g. React, Angular). * Strong experience with Javascript, TypeScript, GraphQL, Ruby, or Node.js * Hands-on proficiency in Python and SQL * Proven ability to lead both technical projects and people * Experience working in a startup or high-growth environment is a strong plus * Deep experience with healthcare or payor data Preferred Experience * Experience with our platform tools: AWS * Experience with Healthcare data Salary Range: $225,000 USD - $265,000 USDAt this time, we are unable to sponsor employment visas. Candidates must beauthorized to work in the United States without a current or future visasponsorship. This role is open to applicants currently residing in the UnitedStates.All qualified applicants will receive consideration for employment withoutregard to race, color, religion, sex, gender identity, sexual orientation,national origin, protected veteran status, or disability status.Show more Show less",
  "location": "",
  "postedAt": "United States 1 week ago",
  "score": 85,
  "source": "linkedin",
  "title": "Vice President, Software Engineering",
  "url": "https://www.linkedin.com/jobs/view/vice-president-software-engineering-at-oasis-health-partners%C2%AE-4334580868?position=1&pageNum=0&refId=rlGkLhOz5TURcPlNsPgRgQ%3D%3D&trackingId=7SIIpoJwhw0clEHulAd6Lw%3D%3D"
}
